package java_prac;

public class Collection_prac {
    public static void main(String[] args) {

        // 컬렉션

        // 배열을 더 고도화 시켜 컬렉션이라는 참조형 분류통(자료구조)가 있다.
        // 컬렉션은 여러 가지 종류가 있고 이러한 컬렉션들은 데이터를 넣고 빼는 방법이
        // 각자 다르기 때문에 용도에 맞게 사용한다.

        // 컬렉션은 배열보다 다수의 참조형 데이터를 더 쉽고 효과적으로 처리할 수 있는 기능을 가지고 있다.
        // 컬렉션 기능 : 크기 자동조정 / 추가 / 수정 / 삭제 / 반복 / 순회 / 필터 / 포함확인 등

        // List : 순서가 있는 데이터의 집합 (데이터 중복 허용) - 배열과 비슷
        // Queue : 먼저 넣은 데이터가 먼저 나온다. FIFO 먼저 들어간 순서대로 값을 조회
        // Stack : 먼저 넣은 데이터가 나중에 나온다. FILO
        // Set : 순서가 없는 데이터의 집합 (데이터 중복 허용 안함) - 순서없고 중복없는 배열 (집합)
        // Map : 순서가 없는 (Key, Value) 쌍으로 이루어진 데이터의 집합 (Key값 중복 허용 안함)

        // 컬렉션은 기본형 변수가 아닌 참조형 변수를 저장합니다.
        // int = Integer
        // long = Long
        // double = Double
        // String은 원래부터 참조형 변수
    }
}
